en/listening.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-24 Sun 08:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Richard Davis, Composer</title>
<meta name="author" content="Richard Davis" />
<meta name="generator" content="Org Mode" />
<link href="/styles/org.css" rel="stylesheet" />
<link href="/styles/style.css" rel="stylesheet" />
<link href="https://fonts.googleapis.com/css?family=JetBrains+Mono&?family=Open+Sans" rel="stylesheet" />
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Richard Davis, Composer
<br />
<span class="subtitle">Listening</span>
</h1>
<div class="org-center">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Home</a></td>
<td class="org-left"><a href="about.html">About</a></td>
<td class="org-left"><a href="events.html">Events</a></td>
<td class="org-left"><a href="listening.html">Listening</a></td>
<td class="org-left"><a href="blog/index.html">Blog</a></td>
<td class="org-left"><a href="../fr/index.html">FR</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-listening-highlights" class="outline-2">
<h2 id="listening-highlights">Highlights</h2>
<div class="outline-text-2" id="text-listening-highlights">
</div>

<div id="outline-container-org958fade" class="outline-3">
<h3 id="org958fade">Till This Moment (2023)</h3>
<div class="outline-text-3" id="text-org958fade">
<p>
"Till This Moment" is a piece for voice and live electronics that adapts the pivotal chapters of Jane Austen's Pride and Prejudice&#x2014;Mr. Darcy's letter and Elizabeth Bennet's reaction to it.
In reading this letter, Elizabeth is confronted with information incompatible with her current worldview, first denying its contents, then considering it more carefully, and finally understanding its truth, ultimately leaving her a transformed and improved person.
The mixed format enables the construction of a dramatic dichotomy between representations of Elizabeth's conscious will, as presented by the performer, and those of the forces exerted upon her by her character, her peers, and the narrative&#x2014;in a word, her soul&#x2014;which are reflected within the electronics. 
</p>

<p>
Vocalist: Dani Claxton
</p>

<p>
Performed Friday, April 14, 2023 at the class concert for MUCO 542.
</p>

<iframe style="border: 0; width: 350px; height: 442px;" src="https://bandcamp.com/EmbeddedPlayer/track=2851746432/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/transparent=true/" seamless><a href="https://richarddavis.bandcamp.com/track/till-this-moment">Till This Moment by Richard Davis</a></iframe>

<p>
Buy the score, patch, and recordings here:
</p>

<a href="https://payhip.com/b/H7vqQ" class="payhip-buy-button" data-theme="grey" data-product="H7vqQ">Buy Now</a>
</div>
</div>

<div id="outline-container-org9885d66" class="outline-3">
<h3 id="org9885d66">fātō profugī (2021)</h3>
<div class="outline-text-3" id="text-org9885d66">
<p>
fātō profugī (refugees from fate) is an opera scene that sets excerpts of the original Dido and Aeneas story from Vergil’s Aeneid in their original classical Latin.
fātō profugī makes reference to various other musical works that are either related to, resonant with, or descended from this text, including Carmen by Georges Bizet, “Lamento della Ninfa” by Claudio Monteverdi, my own "Lament" for string quartet, and Dido and Aeneas by Henry Purcell.
References to these works and to the networks of meaning associated with them create a musical discourse which enables a contemporary reevaluation of this ancient text (and, by extension, other related texts).
</p>

<p>
Recorded April 22, 2022:
</p>
<ul class="org-ul">
<li>Dīdō: Gabrielle Coté-Picard</li>
<li>Aenēās: Wesley Harrison</li>
<li>Piano: Yan-Ru Chen</li>
<li>Mix: Joshua Stanberry</li>
</ul>

<iframe style="border: 0; width: 350px; height: 442px;" src="https://bandcamp.com/EmbeddedPlayer/track=2653807316/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/transparent=true/" seamless><a href="https://richarddavis.bandcamp.com/track/f-t-profug">fātō profugī by Richard Davis</a></iframe>

<p>
Purchase the score and a text companion here:
</p>

<a href="https://payhip.com/b/1A9Xj" class="payhip-buy-button" data-theme="grey" data-product="1A9Xj">Buy Now</a>
</div>
</div>
</div>

<div id="outline-container-orgc06e581" class="outline-2">
<h2 id="orgc06e581">Composition</h2>
<div class="outline-text-2" id="text-orgc06e581">
</div>
<div id="outline-container-org48063a6" class="outline-3">
<h3 id="org48063a6">Variations on an Excerpt (2022)</h3>
<div class="outline-text-3" id="text-org48063a6">
<p>
The work "Variations on an Excerpt" presents an unconventional take on the theme and variations genre, reversing its traditional form factor.
Rather than a theme followed by discrete, increasingly remote variations, "Variations on an Excerpt" presents a continuous set of variations that zoom in on the theme.
The theme itself is the first section of the famous orchestral excerpt for viola from the second movement of Beethoven's Symphony no. 5 (also a theme and variations).
The music preceding this theme explores alternative techniques of variation to those used by Beethoven, favoring those derived from an electronic idiom of composing rather than Beethoven's symbolic and instrumental processes.
</p>

<p>
Recorded May 3, 2022 by violist Marilou Lepage.
</p>

<div class="video">  <iframe src="https://www.youtube-nocookie.com/embed/wyK7qbJSS8E" allowfullscreen></iframe></div>
</div>
</div>

<div id="outline-container-org5980834" class="outline-3">
<h3 id="org5980834">Divide (2021)</h3>
<div class="outline-text-3" id="text-org5980834">
<p>
<i>Divide</i> is a three-movement work for flute/clarinet duo that, as its name suggests, explores musical contrasts and various ways of navigating them, both within movements and between them.
</p>

<p>
Movements 1 and 2 were played by Jayden Lee on flute and Alexander Ortins on clarinet, and were recorded by Monika Azmanska on December 5, 2021.
Movement 3 was performed by Nicole Carbotte on flute and Elia Foster on clarinet, and was recorded by Priam David on April 29, 2022.
</p>

<iframe width="100%" height="300" scrolling="no" frameborder="no" allow="autoplay" src="https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/1503157465&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true"></iframe><div style="font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"><a href="https://soundcloud.com/richard-davis-333277866" title="Richard Davis" target="_blank" style="color: #cccccc; text-decoration: none;">Richard Davis</a> · <a href="https://soundcloud.com/richard-davis-333277866/sets/divide" title="Divide" target="_blank" style="color: #cccccc; text-decoration: none;">Divide</a></div>
</div>
</div>

<div id="outline-container-org784f7c2" class="outline-3">
<h3 id="org784f7c2">Perpetuum (2021)</h3>
<div class="outline-text-3" id="text-org784f7c2">
<p>
"Perpetuum" is a work for small ensemble and voice which sets the poem of the same name by Celine Wang.
</p>

<p class="verse">
Here comes the bride<br />
For all eternity to come<br />
With her unbroken vow as scripture<br />
And so on it goes, as long as we shall live:<br />
<br />
And I will give you constance and I will give you motion<br />
And I will give you major and I will give you minor<br />
And I will give you cosmos and I will give you crumbles<br />
Fidelity<br />
Fidelity<br />
Fidelity<br />
<br />
And I will give you freedom and I will give you burden<br />
And I will give you glory and I will give you solace<br />
And I will give you maidens and I will give you martyrs<br />
Excelsior,<br />
Excelsior,<br />
Excelsior!<br />
<br />
And I will give you presence and I will give you vastness<br />
And I will give you rhythm and I will give you stasis<br />
And I will give you reason and I will give you ardor<br />
Perpetuum<br />
Perpetuum<br />
Perpetuum&#x2026;<br />
</p>

<p>
Performed November 21, 2021:
</p>
<ul class="org-ul">
<li>Vocals: Natalia McKenna</li>
<li>Violin: Celia Morin</li>
<li>Bass Clarinet: Gabriella Janssen</li>
<li>Marimba: Rahul Vanamali</li>
</ul>

<div class="video">  <iframe src="https://www.youtube-nocookie.com/embed/s6qXjExMSBU" allowfullscreen></iframe></div>
</div>
</div>

<div id="outline-container-orgb760825" class="outline-3">
<h3 id="orgb760825">Keystone (2020)</h3>
<div class="outline-text-3" id="text-orgb760825">
<p>
A keystone is the uppermost stone in an arch which holds the whole structure together.
This piece explores, in an acousmatic fashion, this concept of a keystone, and what happens when the keystone crumbles.
</p>

<iframe style="border: 0; width: 350px; height: 442px;" src="https://bandcamp.com/EmbeddedPlayer/track=1955241946/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/transparent=true/" seamless><a href="https://richarddavis.bandcamp.com/track/keystone">Keystone by Richard Davis</a></iframe>
</div>
</div>

<div id="outline-container-org605713c" class="outline-3">
<h3 id="org605713c">Two Pieces for Piano (2020)</h3>
<div class="outline-text-3" id="text-org605713c">
<p>
<i>Two Pieces for Piano</i> is a two-movement work for solo piano that presents grotesque interpretations of two overarching genres: a lullaby that one cannot fall asleep to, and a dance that one cannot dance to.
The lullaby, rather, seeks to tell the story of a lullaby: the melody, no matter how hard it may try to resist, cannot help but eventually be enveloped by the reliable embrace of the harmony.
And the second movement presents a dance between two groups: one energetic and brazen, the other more reserved and lyrical.
The two present their respective portions and work to resolve the disconnect.
</p>

<p>
Recorded December 5, 2020:
</p>
<ul class="org-ul">
<li>Piano: Nicholas Ma</li>
<li>Mix: Andy Le</li>
</ul>

<iframe width="100%" height="300" scrolling="no" frameborder="no" allow="autoplay" src="https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/1246904017&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true"></iframe><div style="font-size: 10px; color: #cccccc;line-break: anywhere;word-break: normal;overflow: hidden;white-space: nowrap;text-overflow: ellipsis; font-family: Interstate,Lucida Grande,Lucida Sans Unicode,Lucida Sans,Garuda,Verdana,Tahoma,sans-serif;font-weight: 100;"><a href="https://soundcloud.com/richard-davis-333277866" title="Richard Davis" target="_blank" style="color: #cccccc; text-decoration: none;">Richard Davis</a> · <a href="https://soundcloud.com/richard-davis-333277866/sets/two-pieces-for-piano" title="Two Pieces for Piano" target="_blank" style="color: #cccccc; text-decoration: none;">Two Pieces for Piano</a></div>
</div>
</div>

<div id="outline-container-org902f369" class="outline-3">
<h3 id="org902f369">One need not be a Chamber (2019)</h3>
<div class="outline-text-3" id="text-org902f369">
<p>
"One need not be a Chamber" is a work for solo clarinet and optional narrator, based on the Emily Dickinson poem "One need not be a Chamber—to be Haunted—".
The music maintains an intimate, line-by-line relationship with the poem, translating various motifs and features of the text into leitmotifs—in the loosest sense—that accompany the emotional arc of Dickinson's poem.
</p>

<p>
Performed Sunday, March 19, 2023 at the Winter Concert for the McGill Association of Student Composers.
</p>
<ul class="org-ul">
<li>Clarinet: Alexander Ortins</li>
<li>Narrator: Dani Claxton</li>
</ul>

<div class="video">  <iframe src="https://www.youtube-nocookie.com/embed/kkycSK4Slow" allowfullscreen></iframe></div>
</div>
</div>
</div>

<div id="outline-container-org168d8fe" class="outline-2">
<h2 id="org168d8fe">Performance</h2>
<div class="outline-text-2" id="text-org168d8fe">
</div>
<div id="outline-container-org3a618d6" class="outline-3">
<h3 id="org3a618d6">Vocalise and Fantasia for Viola &#x2013; Dani Claxton</h3>
<div class="outline-text-3" id="text-org3a618d6">
<p>
Performed November 20, 2022 at the Fall Concert for the McGill Association of Student Composers.
</p>

<div class="video">  <iframe src="https://www.youtube-nocookie.com/embed/2DQ5S-5k_jc" allowfullscreen></iframe></div>
</div>
</div>
</div>

<div id="outline-container-listening-links" class="outline-2">
<h2 id="listening-links">Links</h2>
<div class="outline-text-2" id="text-listening-links">
<p>
If you like what I do and want to consider supporting me, please consider purchasing tracks from my <a href="https://richarddavis.bandcamp.com">Bandcamp</a> or scores from my <a href="https://payhip.com/RichardDavis">Payhip</a>.
If you want to learn more about what I do, all of my music is hosted somewhere between my <a href="https://youtube.com/@davisrichard437">YouTube Channel</a> and my <a href="https://soundcloud.com/richard-davis-333277866">SoundCloud</a>; the YouTube channel focuses on live performances and has some score videos where possible, and the SoundCloud has more studio recordings.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="copyright">© Richard Davis, 2023-12-24 Sun 08:41</p>
</div>
</body>
</html>
